teddokano/usb_uart_prototype/_r01lib_frdm_mcxa153/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_IBE_ibe1 0x01u          /*!<@brief Input Buffer Enable: Enables */
#define PORT1_PCR0_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT1_PCR1_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT1_PCR3_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR0_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR12_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR13_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR16_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR1_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR2_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR4_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR5_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR6_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT3_PCR27_MUX_mux10 0x02u /*!<@brief Pin Multiplex Control: Alternative 2 (chip-specific) */
#define PORT3_PCR28_MUX_mux10 0x02u /*!<@brief Pin Multiplex Control: Alternative 2 (chip-specific) */
#define PORT3_PCR29_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT3_PCR30_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT3_PCR31_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT3_PCR7_MUX_mux101 0x05u /*!<@brief Pin Multiplex Control: Alternative 5 (chip-specific) */

/*! @name PORT3_12 (number 38), ARD_D5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_D5_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_D5_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_D5_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_D5_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_D5_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_D5_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT3_13 (number 37), ARD_D6
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_D6_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_D6_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_D6_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_D6_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_D6_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_D6_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT3_31 (number 30), ARD_A4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_A4_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_A4_GPIO_PIN 31U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_A4_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_A4_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_A4_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_A4_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT3_30 (number 31), ARD_A5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_A5_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_A5_GPIO_PIN 30U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_A5_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_A5_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_A5_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_A5_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT1_12 (number 6), ARD_A1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_A1_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_A1_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_A1_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_A1_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_A1_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_A1_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT1_13 (number 7), ARD_A2
  @{ */

