teddokano/usb_uart_prototype/_r01lib_frdm_mcxa153/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_D10_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_D10_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_D10_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_D10_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_D10_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_D10_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT3_1 (number 45), ARD_D7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_D7_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_D7_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_D7_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_D7_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_D7_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_D7_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT1_4 (number 62), ARD_D0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_D0_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_D0_GPIO_PIN 4U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_D0_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_D0_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_D0_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_D0_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT1_5 (number 63), ARD_D1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_D1_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_D1_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_D1_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_D1_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_D1_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_D1_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT1_10 (number 4), ARD_A0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_A0_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_A0_GPIO_PIN 10U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_A0_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_A0_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_A0_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_A0_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT3_29 (number 32), SW2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SW2_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SW2_GPIO_PIN 29U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SW2_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SW2_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SW2_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SW2_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT1_7 (number 1), SW3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SW3_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SW3_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SW3_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SW3_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SW3_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SW3_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT1_9 (number 3), ARD_D19
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARD_D19_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARD_D19_GPIO_PIN 9U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ARD_D19_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARD_D19_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARD_D19_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARD_D19_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT2_2 (number 16), ADC0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ADC0_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ADC0_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_ADC0_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ADC0_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ADC0_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ADC0_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
